sufzoli/suf-electronics-motor-driver/SW/Misc/M051 PWM (latest)/cmsis_lib/inc/PWM.h
/**************************************************************************//**
 * @file     PWM.h
 * @version  V2.1
 * $Revision: 10 $
 * $Date: 13/06/12 5:46p $
 * @brief    M051 Series PWM Generator and Capture Timer Driver Header File
 *
 * @note
 * Copyright (C) 2011 Nuvoton Technology Corp. All rights reserved.
 *
 *
 ******************************************************************************/
#ifndef __PWM_H__
#define __PWM_H__    

/*---------------------------------------------------------------------------------------------------------*/
/* Includes of system headers                                                                              */
/*---------------------------------------------------------------------------------------------------------*/

#include "M051Series.h"


/** @addtogroup M051_FUNC M051 Function Interface
  * @{
  */

/** @addtogroup PWM_FUNC PWM Device Function Interface
  * @{
  */



/*---------------------------------------------------------------------------------------------------------*/
/* Macro, type and constant definitions                                                                    */
/*---------------------------------------------------------------------------------------------------------*/

/*---------------------------------------------------------------------------------------------------------*/
/*  PPR constants definitions                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_PPR_CP01(x)     (((x)-1) << PWM_PPR_CP01_Pos) /*!< PPR setting for PWM01 clock prescale. x = 2 ~ 256 */
#define PWM_PPR_CP23(x)     (((x)-1) << PWM_PPR_CP23_Pos) /*!< PPR setting for PWM23 clock prescale. x = 2 ~ 256 */
#define PWM_PPR_DZI01(x)    ((x)<< PWM_PPR_DZI01_Pos)  /*!< PPR setting for PWM01 dead zone. x = 0 ~ 255 */
#define PWM_PPR_DZI23(x)    ((x)<< PWM_PPR_DZI23_Pos)  /*!< PPR setting for PWM01 dead zone. x = 0 ~ 255 */

/*---------------------------------------------------------------------------------------------------------*/
/*  CSR constants definitions                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_CSR_DIV1    4         /*!< CSR setting for PWM Timer clock source divided by 1 */
#define PWM_CSR_DIV2    0         /*!< CSR setting for PWM Timer clock source divided by 2 */
#define PWM_CSR_DIV4    1         /*!< CSR setting for PWM Timer clock source divided by 4 */
#define PWM_CSR_DIV8    2         /*!< CSR setting for PWM Timer clock source divided by 8 */
#define PWM_CSR_DIV16   3         /*!< CSR setting for PWM Timer clock source divided by 16 */

#define PWM_CSR_CSR0(x)     ((x) << PWM_CSR_CSR0_Pos) /*!< CSR setting for CSR0 */
#define PWM_CSR_CSR1(x)     ((x) << PWM_CSR_CSR1_Pos) /*!< CSR setting for CSR1 */
#define PWM_CSR_CSR2(x)     ((x) << PWM_CSR_CSR2_Pos) /*!< CSR setting for CSR2 */
#define PWM_CSR_CSR3(x)     ((x) << PWM_CSR_CSR3_Pos) /*!< CSR setting for CSR3 */

/*---------------------------------------------------------------------------------------------------------*/
/*  PCR constants definitions                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_PCR_CH0EN_ENABLE    (1UL << PWM_PCR_CH0EN_Pos) /*!< PCR setting for channel 0 Timer Enable */
#define PWM_PCR_CH1EN_ENABLE    (1UL << PWM_PCR_CH1EN_Pos) /*!< PCR setting for channel 1 Timer Enable */
#define PWM_PCR_CH2EN_ENABLE    (1UL << PWM_PCR_CH2EN_Pos) /*!< PCR setting for channel 2 Timer Enable */
#define PWM_PCR_CH3EN_ENABLE    (1UL << PWM_PCR_CH3EN_Pos) /*!< PCR setting for channel 3 Timer Enable */
#define PWM_PCR_CH0INV_ENABLE  (1UL << PWM_PCR_CH0INV_Pos) /*!< PCR setting for channel 0 PWM-Timer Output Inverter Enable */
#define PWM_PCR_CH1INV_ENABLE  (1UL << PWM_PCR_CH1INV_Pos) /*!< PCR setting for channel 1 PWM-Timer Output Inverter Enable */
#define PWM_PCR_CH2INV_ENABLE  (1UL << PWM_PCR_CH2INV_Pos) /*!< PCR setting for channel 2 PWM-Timer Output Inverter Enable */
#define PWM_PCR_CH3INV_ENABLE  (1UL << PWM_PCR_CH3INV_Pos) /*!< PCR setting for channel 3 PWM-Timer Output Inverter Enable */
#define PWM_PCR_CH0MOD_AUTO_RELOAD (1UL << PWM_PCR_CH0MOD_Pos) /*!< PCR setting for channel 0 Timer auto-reload mode */
#define PWM_PCR_CH1MOD_AUTO_RELOAD (1UL << PWM_PCR_CH1MOD_Pos) /*!< PCR setting for channel 1 Timer auto-reload mode */
#define PWM_PCR_CH2MOD_AUTO_RELOAD (1UL << PWM_PCR_CH2MOD_Pos) /*!< PCR setting for channel 2 Timer auto-reload mode */
#define PWM_PCR_CH3MOD_AUTO_RELOAD (1UL << PWM_PCR_CH3MOD_Pos) /*!< PCR setting for channel 3 Timer auto-reload mode */
#define PWM_PCR_CH0MOD_ONE_SHOT    (0UL << PWM_PCR_CH0MOD_Pos) /*!< PCR setting for channel 0 Timer one-shot mode */
#define PWM_PCR_CH1MOD_ONE_SHOT    (0UL << PWM_PCR_CH1MOD_Pos) /*!< PCR setting for channel 1 Timer one-shot mode */
#define PWM_PCR_CH2MOD_ONE_SHOT    (0UL << PWM_PCR_CH2MOD_Pos) /*!< PCR setting for channel 2 Timer one-shot mode */
#define PWM_PCR_CH3MOD_ONE_SHOT    (0UL << PWM_PCR_CH3MOD_Pos) /*!< PCR setting for channel 3 Timer one-shot mode */
#define PWM_PCR_DZEN01_ENABLE (1UL << PWM_PCR_DZEN01_Pos) /*!< PCR setting for Dead-Zone 0 Generator Enable/ */
#define PWM_PCR_DZEN23_ENABLE (1UL << PWM_PCR_DZEN23_Pos) /*!< PCR setting for Dead-Zone 2 Generator Enable/ */
#define PWM_PCR_PWM01TYPE_EDGE_ALIGNED      (0UL << PWM_PCR_PWM01TYPE_Pos) /*!< PCR setting for PWM01 Edge-aligned type */
#define PWM_PCR_PWM01TYPE_CENTER_ALIGNED    (1UL << PWM_PCR_PWM01TYPE_Pos) /*!< PCR setting for PWM01 Center-aligned type*/
#define PWM_PCR_PWM23TYPE_EDGE_ALIGNED      (0UL << PWM_PCR_PWM23TYPE_Pos) /*!< PCR setting for PWM23 Edge-aligned type */
#define PWM_PCR_PWM23TYPE_CENTER_ALIGNED    (1UL << PWM_PCR_PWM23TYPE_Pos) /*!< PCR setting for PWM23 Center-aligned type*/

/*---------------------------------------------------------------------------------------------------------*/
/*  PIER constants definitions                                                                             */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_PIER_PWMIE0_ENABLE  (1UL << PWM_PIER_PWMIE0_Pos) /*!< PIER setting for channel 0 Timer period Interrupt Enable */
#define PWM_PIER_PWMIE1_ENABLE  (1UL << PWM_PIER_PWMIE1_Pos) /*!< PIER setting for channel 1 Timer period Interrupt Enable */
#define PWM_PIER_PWMIE2_ENABLE  (1UL << PWM_PIER_PWMIE2_Pos) /*!< PIER setting for channel 2 Timer period Interrupt Enable */
#define PWM_PIER_PWMIE3_ENABLE  (1UL << PWM_PIER_PWMIE3_Pos) /*!< PIER setting for channel 3 Timer period Interrupt Enable */

#define PWM_PIER_PWMDIE0_ENABLE  (1UL << PWM_PIER_PWMDIE0_Pos) /*!< PIER setting for channel 0 Timer duty Interrupt Enable */
#define PWM_PIER_PWMDIE1_ENABLE  (1UL << PWM_PIER_PWMDIE1_Pos) /*!< PIER setting for channel 1 Timer duty Interrupt Enable */
#define PWM_PIER_PWMDIE2_ENABLE  (1UL << PWM_PIER_PWMDIE2_Pos) /*!< PIER setting for channel 2 Timer duty Interrupt Enable */
#define PWM_PIER_PWMDIE3_ENABLE  (1UL << PWM_PIER_PWMDIE3_Pos) /*!< PIER setting for channel 3 Timer duty Interrupt Enable */

#define PWM_PIER_INT01TYPE_UNDERFLOW        (0UL << PWM_PIER_INT01TYPE_Pos) /*!< PIER setting for channel 0/1 period interrupt set when counter equals zero*/
#define PWM_PIER_INT01TYPE_MATCH_CNR        (1UL << PWM_PIER_INT01TYPE_Pos) /*!< PIER setting for channel 0/1 period interrupt set when counter equals CNR */

#define PWM_PIER_INT23TYPE_UNDERFLOW        (0UL << PWM_PIER_INT23TYPE_Pos) /*!< PIER setting for channel 2/3 period interrupt set when counter equals zero*/
#define PWM_PIER_INT23TYPE_MATCH_CNR        (1UL << PWM_PIER_INT23TYPE_Pos) /*!< PIER setting for channel 2/3 period interrupt set when counter equals CNR */

#define PWM_PIER_INT01DTYPE_CMRD            (0UL << PWM_PIER_INT01DTYPE_Pos) /*!< PIER setting for channel 0/1 duty interrupt be set when counter equals CMR on down-count*/
#define PWM_PIER_INT01DTYPE_CMRU            (1UL << PWM_PIER_INT01DTYPE_Pos) /*!< PIER setting for channel 0/1 duty interrupt be set when counter equals CMR on up-count */

#define PWM_PIER_INT23DTYPE_CMRD            (0UL << PWM_PIER_INT23DTYPE_Pos) /*!< PIER setting for channel 2/3 duty interrupt be set when counter equals CMR on down-count*/
#define PWM_PIER_INT23DTYPE_CMRU            (1UL << PWM_PIER_INT23DTYPE_Pos) /*!< PIER setting for channel 2/3 duty interrupt be set when counter equals CMR on up-count */

/*---------------------------------------------------------------------------------------------------------*/
/*  CCR0/CCR2 constants definitions                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_CCR0_INV0_ENABLE  (1UL << PWM_CCR0_INV0_Pos) /*!< CCR0 setting for Channel 0 Capture Inverter enable */
#define PWM_CCR0_INV1_ENABLE  (1UL << PWM_CCR0_INV1_Pos) /*!< CCR0 setting for Channel 1 Capture Inverter enable */
#define PWM_CCR2_INV2_ENABLE  (1UL << PWM_CCR2_INV2_Pos) /*!< CCR2 setting for Channel 2 Capture Inverter enable */
#define PWM_CCR2_INV3_ENABLE  (1UL << PWM_CCR2_INV3_Pos) /*!< CCR2 setting for Channel 3 Capture Inverter enable */

#define PWM_CCR0_CRL_IE0_ENABLE  (1UL << PWM_CCR0_CRL_IE0_Pos) /*!< CCR0 setting for Channel 0 Capture Rising Latch Interrupt Enable */
#define PWM_CCR0_CRL_IE1_ENABLE  (1UL << PWM_CCR0_CRL_IE1_Pos) /*!< CCR0 setting for Channel 1 Capture Rising Latch Interrupt Enable */
#define PWM_CCR2_CRL_IE2_ENABLE  (1UL << PWM_CCR2_CRL_IE2_Pos) /*!< CCR2 setting for Channel 2 Capture Rising Latch Interrupt Enable */
#define PWM_CCR2_CRL_IE3_ENABLE  (1UL << PWM_CCR2_CRL_IE3_Pos) /*!< CCR2 setting for Channel 3 Capture Rising Latch Interrupt Enable */

#define PWM_CCR0_CFL_IE0_ENABLE  (1UL << PWM_CCR0_CFL_IE0_Pos) /*!< CCR0 setting for Channel 0 Capture Falling Latch Interrupt Enable */
#define PWM_CCR0_CFL_IE1_ENABLE  (1UL << PWM_CCR0_CFL_IE1_Pos) /*!< CCR0 setting for Channel 1 Capture Falling Latch Interrupt Enable */
#define PWM_CCR2_CFL_IE2_ENABLE  (1UL << PWM_CCR2_CFL_IE2_Pos) /*!< CCR2 setting for Channel 2 Capture Falling Latch Interrupt Enable */
#define PWM_CCR2_CFL_IE3_ENABLE  (1UL << PWM_CCR2_CFL_IE3_Pos) /*!< CCR2 setting for Channel 3 Capture Falling Latch Interrupt Enable */

#define PWM_CCR0_CAPCH0EN_ENABLE  (1UL << PWM_CCR0_CAPCH0EN_Pos) /*!< CCR0 setting for Channel 0 Capture Function Enable */
#define PWM_CCR0_CAPCH1EN_ENABLE  (1UL << PWM_CCR0_CAPCH1EN_Pos) /*!< CCR0 setting for Channel 1 Capture Function Enable */
#define PWM_CCR2_CAPCH2EN_ENABLE  (1UL << PWM_CCR2_CAPCH2EN_Pos) /*!< CCR2 setting for Channel 2 Capture Function Enable */
#define PWM_CCR2_CAPCH3EN_ENABLE  (1UL << PWM_CCR2_CAPCH3EN_Pos) /*!< CCR2 setting for Channel 3 Capture Function Enable */

/*---------------------------------------------------------------------------------------------------------*/
/*  CAPENR constants definitions                                                                           */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_CAPENR_CINEN0_ENABLE  (1UL << PWM_CAPENR_CINEN0_Pos) /*!< CAPENR setting for Channel 0 Capture Input Enable */
#define PWM_CAPENR_CINEN1_ENABLE  (1UL << PWM_CAPENR_CINEN1_Pos) /*!< CAPENR setting for Channel 1 Capture Input Enable */
#define PWM_CAPENR_CINEN2_ENABLE  (1UL << PWM_CAPENR_CINEN2_Pos) /*!< CAPENR setting for Channel 2 Capture Input Enable */
#define PWM_CAPENR_CINEN3_ENABLE  (1UL << PWM_CAPENR_CINEN3_Pos) /*!< CAPENR setting for Channel 3 Capture Input Enable */

/*---------------------------------------------------------------------------------------------------------*/
/*  POE constants definitions                                                                              */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_POE_PWM0_ENABLE  (1UL << PWM_POE_PWM0_Pos) /*!< POE setting for Channel 0 PWM Output Enable */
#define PWM_POE_PWM1_ENABLE  (1UL << PWM_POE_PWM1_Pos) /*!< POE setting for Channel 1 PWM Output Enable */
#define PWM_POE_PWM2_ENABLE  (1UL << PWM_POE_PWM2_Pos) /*!< POE setting for Channel 2 PWM Output Enable */
#define PWM_POE_PWM3_ENABLE  (1UL << PWM_POE_PWM3_Pos) /*!< POE setting for Channel 3 PWM Output Enable */

/*---------------------------------------------------------------------------------------------------------*/
/*  TCON constants definitions                                                                             */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_TCON_PWM0TEN_ENABLE  (1UL << PWM_TCON_PWM0TEN_Pos) /*!< TCON setting for enable Channel 0 PWM trigger ADC to start of conversion */
#define PWM_TCON_PWM1TEN_ENABLE  (1UL << PWM_TCON_PWM1TEN_Pos) /*!< TCON setting for enable Channel 1 PWM trigger ADC to start of conversion */
#define PWM_TCON_PWM2TEN_ENABLE  (1UL << PWM_TCON_PWM2TEN_Pos) /*!< TCON setting for enable Channel 2 PWM trigger ADC to start of conversion */
#define PWM_TCON_PWM3TEN_ENABLE  (1UL << PWM_TCON_PWM3TEN_Pos) /*!< TCON setting for enable Channel 3 PWM trigger ADC to start of conversion */

