sufzoli/suf-electronics-motor-driver/SW/Misc/M051 PWM (latest)/cmsis_lib/inc/PWM.h
#define PWM_TCON_PWM0DTEN_ENABLE  (1UL << PWM_TCON_PWM0DTEN_Pos) /*!< TCON setting for enable Channel 0 PWM trigger ADC to start of conversion */
#define PWM_TCON_PWM1DTEN_ENABLE  (1UL << PWM_TCON_PWM1DTEN_Pos) /*!< TCON setting for enable Channel 1 PWM trigger ADC to start of conversion */
#define PWM_TCON_PWM2DTEN_ENABLE  (1UL << PWM_TCON_PWM2DTEN_Pos) /*!< TCON setting for enable Channel 2 PWM trigger ADC to start of conversion */
#define PWM_TCON_PWM3DTEN_ENABLE  (1UL << PWM_TCON_PWM3DTEN_Pos) /*!< TCON setting for enable Channel 3 PWM trigger ADC to start of conversion */

/*---------------------------------------------------------------------------------------------------------*/
/*  PSCR constants definitions                                                                             */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_PSCR_PSSEN0_ENABLE  (1UL << PWM_PSCR_PSSEN0_Pos) /*!< PSCR setting for enable group PWM0 Synchronous Start */
#define PWM_PSCR_PSSEN1_ENABLE  (1UL << PWM_PSCR_PSSEN1_Pos) /*!< PSCR setting for enable group PWM1 Synchronous Start */
#define PWM_PSCR_PSSEN2_ENABLE  (1UL << PWM_PSCR_PSSEN2_Pos) /*!< PSCR setting for enable group PWM2 Synchronous Start */
#define PWM_PSCR_PSSEN3_ENABLE  (1UL << PWM_PSCR_PSSEN3_Pos) /*!< PSCR setting for enable group PWM3 Synchronous Start */

/*---------------------------------------------------------------------------------------------------------*/
/*  PWM Group channel numebr constants definitions                                                         */
/*---------------------------------------------------------------------------------------------------------*/
#define PWM_CH0     0x0            /*!< PWM Group A/B channel 0 */
#define PWM_CH1     0x1            /*!< PWM Group A/B channel 1 */
#define PWM_CH2     0x2            /*!< PWM Group A/B channel 2 */
#define PWM_CH3     0x3            /*!< PWM Group A/B channel 3 */

#define PWM_CCR_MASK    0x000F000F          /*!< PWM CCR0/CCR2 bit0~3 and bit16~19 mask */ 


/**
 * @brief      Set timer pre-scale for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3     
 * @param[in]  u32Prescaler   PWM timer prescaler value(0 ~ 0xFF)
 *
 * @return     None
 *
 * @details    This function is used to set timer pre-scale for specified channel
 *
 * @note       - If u32Prescaler = 0, corresponding PWM-timer will be stopped
 *             - If u32Prescaler = x (x not equal to 0), it means Clock input is divided by (x + 1) before it is fed to the corresponding PWM counter.
 
 */
#define _PWM_SET_TIMER_PRESCALE(PWM,u32Ch,u32Prescaler)\
{\
    (PWM)->PPR = (PWM)->PPR&~(PWM_PPR_CP01_Msk<<(((u32Ch)/2)*8))\
                                 |((u32Prescaler)<<(PWM_PPR_CP01_Pos+(((u32Ch)/2)*8)));\
}




/**
 * @brief      Get timer pre-scale for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3     
 * @return     Pre-scaler value (0~0xFF)
 *
 * @details    This function is used to get timer pre-scale for specified channel
 *
 * @note       - If retuened Pre-scaler value = 0, it means corresponding PWM-timer stop
 *             - If retuened Pre-scaler value = x (x not equal to 0), it means Clock input is divided by (x + 1) before it is fed to the corresponding PWM counter.
 */
#define _PWM_GET_TIMER_PRESCALE(PWM,u32Ch) (((PWM)->PPR&(PWM_PPR_CP01_Msk<<(((u32Ch)/2)*8)))>>(PWM_PPR_CP01_Pos+(((u32Ch)/2)*8)))




/**
 * @brief      Set PWM dead-zone length for specified channel pair
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH2   
 * @param[in]  u32DeadZoneLen PWM dead-zone length (0 - 0xFF)
 *
 * @return     None
 *
 * @details    This function is used to set PWM dead-zone length for specified channel.\n
 *             The unit time of dead zone length = [(prescale+1)*(clock source divider)]/PWMxy_CLK ,\n
 *             where xy, could be 01, 23 depends on selected PWM channel for PWM group A/B.
 *
 * @note       - Channel 0 and channel 1 are complementary pair and share the same dead-zone length.
 *             - Channel 2 and channel 3 are complementary pair and share the same dead-zone length. 
 *
 */
#define _PWM_SET_PWM_DEADZONE_LENGTH(PWM,u32Ch,u32DeadZoneLen)\
{\
    (PWM)->PPR = (PWM)->PPR&~(PWM_PPR_DZI01_Msk<<(((u32Ch)/2)*8))\
                                 |((u32DeadZoneLen)<<(PWM_PPR_DZI01_Pos+(((u32Ch)/2)*8)));\
}



/**
 * @brief       Get PWM dead-zone length for specified channel pair
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH2   
 *
 * @return     Specified channel PWM dead-zone length (0 - 0xFF)
 *
 * @details    This function is used to get PWM dead-zone length for specified channel.
 *
 *             The unit time of dead zone length = [(prescale+1)*(clock source divider)]/PWMxy_CLK , \n
 *             where xy, could be 01, 23, depends on selected PWM channel for PWM group A/B..
 *
 * @note       - Channel 0 and channel 1 are complementary pair and share the same dead-zone length.
 *             - Channel 2 and channel 3 are complementary pair and share the same dead-zone length.  
 */
#define _PWM_GET_PWM_DEADZONE_LENGTH(PWM,u32Ch) (((PWM)->PPR&(PWM_PPR_DZI01_Msk<<(((u32Ch)/2)*8)))>>(PWM_PPR_DZI01_Pos+(((u32Ch)/2)*8)))




/**
 * @brief       Set Timer clock source divider selection for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3     
 * @param[in]  u32ClockDivSel Timer clock source divider selection
 *                            - PWM_CSR_DIV1 (4)
 *                            - PWM_CSR_DIV2 (0) 
 *                            - PWM_CSR_DIV4 (1) 
 *                            - PWM_CSR_DIV8 (2) 
 *                            - PWM_CSR_DIV16(3)   
 *
 * @return     None
 *
 * @details    This function is used to set Timer clock source divider selection for specified channel
 *
 */
#define _PWM_SET_TIMER_CLOCK_DIV(PWM,u32Ch,u32ClockDivSel)\
{\
    (PWM)->CSR = (PWM)->CSR&~(PWM_CSR_CSR0_Msk<<((u32Ch)*4))\
                                 |((u32ClockDivSel)<<(PWM_CSR_CSR0_Pos+((u32Ch)*4)));\
}


/**
 * @brief      Get timer clock source divider selection for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3     
 * @retval     4              Input clock divided by 1
 * @retval     0              Input clock divided by 2
 * @retval     1              Input clock divided by 4
 * @retval     2              Input clock divided by 8
 * @retval     3              Input clock divided by 16    
 *
 * @details    This function is used to get timer clock source divider selection for specified channel
 *
 */
#define _PWM_GET_TIMER_CLOCK_DIV(PWM,u32Ch) (((PWM)->CSR&(PWM_CSR_CSR0_Msk<<((u32Ch)*4)))>>(PWM_CSR_CSR0_Pos+((u32Ch)*4)))




/**
 * @brief      Enable timer for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable timer for specified channel
 *
 */
#define _PWM_ENABLE_TIMER(PWM,u32Ch) (PWM)->PCR|= (PWM_PCR_CH0EN_Msk<<((u32Ch)*8))




/**
 * @brief      Disable timer for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable timer for specified channel
 *
 */
#define _PWM_DISABLE_TIMER(PWM,u32Ch) (PWM)->PCR&= ~(PWM_PCR_CH0EN_Msk<<((u32Ch)*8))




/**
 * @brief      Enable PWM output polar inverse for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable PWM output polar inverse for specified channel
 *
 */
#define _PWM_ENABLE_PWM_POLAR_INV(PWM,u32Ch) (PWM)->PCR|= (PWM_PCR_CH0PINV_Msk<<((u32Ch)*8))



/**
 * @brief      Disable PWM output polar inverse for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable PWM output polar inverse for specified channel
 *
 */
#define _PWM_DISABLE_PWM_POLAR_INV(PWM,u32Ch) (PWM)->PCR&= ~(PWM_PCR_CH0PINV_Msk<<((u32Ch)*8))



/**
 * @brief      Enable PWM output inveter for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable PWM output inveter for specified channel
 *
 */
#define _PWM_ENABLE_PWM_INV(PWM,u32Ch) (PWM)->PCR|= (PWM_PCR_CH0INV_Msk<<((u32Ch)*8))



/**
 * @brief      Disable PWM output inveter for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable PWM output inveter for specified channel
 *
 */
#define _PWM_DISABLE_PWM_INV(PWM,u32Ch) (PWM)->PCR&= ~(PWM_PCR_CH0INV_Msk<<((u32Ch)*8))




/**
 * @brief      Set timer auto-reolad mode for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to set timer auto-reolad mode for specified channel
 *
 * @note       If user changes timer mode from auto-reload to one-shot or from one-shot to auto-reload mode,\n
 *             it will cause CNR0 and CMR0 be clear.
 *
 */
#define _PWM_SET_TIMER_AUTO_RELOAD_MODE(PWM,u32Ch) (PWM)->PCR |= (PWM_PCR_CH0MOD_Msk<<((u32Ch)*8))




/**
 * @brief      Set timer One-shot mode for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to set timer One-shot mode for specified channel
 *
 * @note       - If user changes timer mode from auto-reload to one-shot or from one-shot to auto-reload mode,\n
 *             it will cause CNR0 and CMR0 be clear.
 *             - After PWM waveform generated once in PWM one-shot mode, CNR and CMR settings will be cleared and\n
 *               PWM-Timer will stop automatically.
 *               The following procedure is recommended for re-starting PWM single-shot waveform.
 *               Step 1: Setup comparator register (CMR) for setting PWM duty.
 *               Step 2: Setup PWM down-counter register (CNR) for setting PWM period. After setup CNR, PWM wave will be generated once again.
 *
 */
#define _PWM_SET_TIMER_ONE_SHOT_MODE(PWM,u32Ch) (PWM)->PCR &= ~(PWM_PCR_CH0MOD_Msk<<((u32Ch)*8))




/**
 * @brief      Enable PWM Dead-Zone generator for specified channel pair
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH2   
 * @return     None
 *
 * @details    This function is used to enable PWM Dead-Zone generator for specified channel pair
 *
 * @note       - When Channel 0 Dead-Zone Generator is enabled, channel 0 and channel 1 becomes a complementary pair.  
 *             - When Channel 2 Dead-Zone Generator is enabled, channel 2 and channel 3 becomes a complementary pair.  
 *
 */
#define _PWM_ENABLE_PWM_DEADZONE(PWM,u32Ch) (PWM)->PCR|=(PWM_PCR_DZEN01_Msk<<((u32Ch)/2))




/**
 * @brief      Disable PWM Dead-Zone generator for specified channel pair
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable PWM Dead-Zone generator for specified channel pair
 *
 */
#define _PWM_DISABLE_PWM_DEADZONE(PWM,u32Ch) (PWM)->PCR&=~(PWM_PCR_DZEN01_Msk<<((u32Ch)/2))



/**
 * @brief      Set timer edge-aligned type for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to set timer edge-aligned type for specified channel
 *
 *
 */
#define _PWM_SET_TIMER_EDGE_ALIGNED_TYPE(PWM,u32Ch) (PWM)->PCR &= ~(PWM_PCR_PWM01TYPE_Msk<<((u32Ch)/2))




/**
 * @brief      Set timer center-aligned type for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to set timer center-aligned type for specified channel
 *
 *
 */
#define _PWM_SET_TIMER_CENTER_ALIGNED_TYPE(PWM,u32Ch) (PWM)->PCR |= (PWM_PCR_PWM01TYPE_Msk<<((u32Ch)/2))




/**
 * @brief      Set timer loaded value for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3  
 * @param[in]  u32LoadedVal   Timer loaded value(0~0xFFFF)
 *     
 * @return     None
 *
 * @details    This function is used to set timer loaded value(CNR) for specified channel.\n
 *             Loaded value determines the PWM period.
 *
 * @note       - If u32LoadedVal=0, PWM timer counter will stop.   
 *
 */
#define _PWM_SET_TIMER_LOADED_VALUE(PWM,u32Ch,u32LoadedVal)\
{\
     (*((__IO uint32_t *) (((uint32_t)&((PWM)->CNR0) + (u32Ch)*12))) = (u32LoadedVal));\
}



/**
 * @brief      Get timer loaded value for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     Timer loaded value (0 - 0xFFFF)
 *
 * @details    This function is used to get timer loaded value for specified channel
 *
 */
#define _PWM_GET_TIMER_LOADED_VALUE(PWM,u32Ch) (*((__IO uint32_t *) (((uint32_t)&((PWM)->CNR0) + (u32Ch)*12))))




/**
 * @brief      Set PWM Comparator value for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3  
 * @param[in]  u32Compatator  PWM Comparator value (0 - 0xFFFF)
 *  
 * @return     None
 *
 * @details    This function is used to set PWM Comparator value for specified channel
 *
 */
#define _PWM_SET_PWM_COMP_VALUE(PWM,u32Ch,u32Compatator)\
{\
     (*((__IO uint32_t *) (((uint32_t)&((PWM)->CMR0) + (u32Ch)*12))) = (u32Compatator));\
}



/**
 * @brief      Get PWM Comparator value for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     PWM Comparator value (0 - 0xFFFF)
 *
 * @details    This function is used to get PWM Comparator value for specified channel
 *
 */
#define _PWM_GET_PWM_COMP_VALUE(PWM,u32Ch) (*((__IO uint32_t *) (((uint32_t)&((PWM)->CMR0) + (u32Ch)*12))))




/**
 * @brief      Get timer current counter value for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3 
 * @return     Timer current counter value (0 - 0xFFFF)      
 *
 * @details    This function is used to get timer current counter value(PDR) for specified channel.\n
 *             User can monitor PDR to know the current value in 16-bit counter.
 *
 */
#define _PWM_GET_TIMER_CURRENT_COUNTER_VALUE(PWM,u32Ch) (*((__IO uint32_t *) (((uint32_t)&((PWM)->PDR0)) + (u32Ch)*12)))




/**
 * @brief      Enable timer period interrupt for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable timer period interrupt for specified channel
 *
 */
#define _PWM_ENABLE_TIMER_PERIOD_INT(PWM,u32Ch) ((PWM)->PIER|= (PWM_PIER_PWMIE0_Msk<<(u32Ch)))



/**
 * @brief       Disable timer period interrupt for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable timer period interrupt for specified channel
 *
 */
#define _PWM_DISABLE_TIMER_PERIOD_INT(PWM,u32Ch) ((PWM)->PIER&= ~(PWM_PIER_PWMIE0_Msk<<(u32Ch)))




/**
 * @brief      Enable timer duty interrupt for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable timer duty interrupt for specified channel
 *
 */
#define _PWM_ENABLE_TIMER_DUTY_INT(PWM,u32Ch) ((PWM)->PIER|= (PWM_PIER_PWMDIE0_Msk<<(u32Ch)))



/**
 * @brief       Disable timer duty interrupt for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable timer duty interrupt for specified channel
 *
 */
#define _PWM_DISABLE_TIMER_DUTY_INT(PWM,u32Ch) ((PWM)->PIER &= ~(PWM_PIER_PWMDIE0_Msk<<(u32Ch)))



