sufzoli/suf-electronics-motor-driver/SW/Misc/M051 PWM (latest)/cmsis_lib/inc/PWM.h
/**
 * @brief      Set timer interrupt period type interrupt to counter matches to CNR for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to set timer interrupt period type interrupt to counter matches to CNR for specified channel
 *
 * @note       This bit is effective when timer in center aligned type only.
 *             
 */
#define _PWM_SET_TIMER_PERIOD_INTTYPE_MATCH_CNR(PWM,u32Ch) ((PWM)->PIER|= (PWM_PIER_INT01TYPE_Msk<<((u32Ch)/2)))




/**
 * @brief      Set timer interrupt period type interrupt to counter underflow for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to set timer interrupt period type interrupt to counter matches to CNR for specified channel
 *
 * @note       This function is effective when timer in center aligned type only.
 * 
 */
#define _PWM_SET_TIMER_PERIOD_INTTYPE_UNDERFLOW(PWM,u32Ch) ((PWM)->PIER&= ~(PWM_PIER_INT01TYPE_Msk<<((u32Ch)/2)))




/**
 * @brief      Configure system will generate duty interrtup when counter equals to CMR register on down-count for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to configure system will generate duty interrtup when counter equals to CMR register on down-count for specified channel
 *
 */
#define _PWM_SET_TIMER_DUTY_INTTYPE_CMRD(PWM,u32Ch) ((PWM)->PIER &= ~(PWM_PIER_INT01DTYPE_Msk<<((u32Ch)/2)))



/**
 * @brief      Configure system will generate duty interrtup when counter equals to CMR register on UP-count for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to configure system will generate duty interrtup when counter equals to CMR register on UP-count for specified channel
 *
 */
#define _PWM_SET_TIMER_DUTY_INTTYPE_CMRU(PWM,u32Ch) ((PWM)->PIER |= (PWM_PIER_INT01DTYPE_Msk<<((u32Ch)/2)))




/**
 * @brief       Get timer period interrupt flag for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @retval      0             The specified channel timer period interrupt flag is not set 
 * @retval      1             The specified channel timer period interrupt flag is set
 *
 * @details    This function is used to get timer period interrupt flag for specified channel
 *
 */
#define _PWM_GET_TIMER_PERIOD_INT_FLAG(PWM,u32Ch) (((PWM)->PIIR&(PWM_PIIR_PWMIF0_Msk<<(u32Ch)))?1:0)




/**
 * @brief      Clear timer period interrupt flag for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to clear timer period interrupt flag for specified channel
 *
 */
#define _PWM_CLEAR_TIMER_PERIOD_INT_FLAG(PWM,u32Ch) ((PWM)->PIIR = (PWM_PIIR_PWMIF0_Msk<<(u32Ch)))




/**
 * @brief       Get timer duty interrupt flag for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @retval      0             The specified channel timer duty interrupt flag is not set 
 * @retval      1             The specified channel timer duty interrupt flag is set
 *
 * @details    This function is used to get timer duty interrupt flag for specified channel
 *
 */
#define _PWM_GET_TIMER_DUTY_INT_FLAG(PWM,u32Ch) (((PWM)->PIIR&(PWM_PIIR_PWMDIF0_Msk<<(u32Ch)))?1:0)


/**
 * @brief      Clear timer duty interrupt flag for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to clear timer duty interrupt flag for specified channel
 *
 */
#define _PWM_CLEAR_TIMER_DUTY_INT_FLAG(PWM,u32Ch) ((PWM)->PIIR = (PWM_PIIR_PWMDIF0_Msk<<(u32Ch)))





/**
 * @brief      Enable capture input inverter for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable capture input inverter for specified channel
 *
 *
 */
#define _PWM_ENABLE_CAP_INV(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_INV0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_INV2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief      Disable capture input inverter for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable capture input inverter for specified channel
 *
 *
 */
#define _PWM_DISABLE_CAP_INV(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = ((PWM)->CCR0&PWM_CCR_MASK)&~(PWM_CCR0_INV0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = ((PWM)->CCR2&PWM_CCR_MASK)&~(PWM_CCR2_INV2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Enable capture rising latch interrupt for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable capture rising latch interrupt for specified channel
 *
 *
 */
#define _PWM_ENABLE_CAP_RISING_INT(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_CRL_IE0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_CRL_IE2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Disable capture rising latch interrupt for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable capture rising latch interrupt for specified channel
 *
 *
 */
#define _PWM_DISABLE_CAP_RISING_INT(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = ((PWM)->CCR0&PWM_CCR_MASK)&~(PWM_CCR0_CRL_IE0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = ((PWM)->CCR2&PWM_CCR_MASK)&~(PWM_CCR2_CRL_IE2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Enable capture falling latch interrupt for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable capture falling latch interrupt for specified channel
 *
 *
 */
#define _PWM_ENABLE_CAP_FALLING_INT(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_CFL_IE0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_CFL_IE2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Disable capture falling latch interrupt for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable capture falling latch interrupt for specified channel
 *
 *
 */
#define _PWM_DISABLE_CAP_FALLING_INT(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = ((PWM)->CCR0&PWM_CCR_MASK)&~(PWM_CCR0_CFL_IE0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = ((PWM)->CCR2&PWM_CCR_MASK)&~(PWM_CCR2_CFL_IE2_Msk<<(((u32Ch)%2)*16)));\
}


/**
 * @brief       Enable capture function for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable capture function for specified channel
 *
 * @note        When capture function enabled, Capture latched the PWM-counter value and saved to CRLR (Rising latch) and CFLR (Falling latch). 
 *
 */
#define _PWM_ENABLE_CAP_FUNC(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_CAPCH0EN_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_CAPCH2EN_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Disable capture function for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable capture function for specified channel
 *
 * @note        When capture function disabled, Capture does not update CRLR and CFLR, and disable specified channel Interrupt.
 *
 */
#define _PWM_DISABLE_CAP_FUNC(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = ((PWM)->CCR0&PWM_CCR_MASK)&~(PWM_CCR0_CAPCH0EN_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = ((PWM)->CCR2&PWM_CCR_MASK)&~(PWM_CCR2_CAPCH2EN_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Get capture interrupt flag for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @retval      0             The specified channel capture interrupt flag is not set 
 * @retval      1             The specified channel capture interrupt flag is set
 *
 * @details     This function is used to get capture interrupt flag for specified channel
 *
 *
 */
#define _PWM_GET_CAP_INT_FLAG(PWM,u32Ch) (((u32Ch)<2)?(((PWM)->CCR0 >> PWM_CCR0_CAPIF0_Pos >> ((u32Ch)*16)) & 1):(((PWM)->CCR2 >> PWM_CCR2_CAPIF2_Pos >> (((u32Ch)%2)*16)) & 1))



/**
 * @brief      Clear capture interrupt flag for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to clear capture interrupt flag for specified channel
 *
 * @note       Write 1 to clear this bit
 *
 */
#define _PWM_CLR_CAP_INT_FLAG(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_CAPIF0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_CAPIF2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Get capture rising latched indicator for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @retval      0             The specified channel capture falling rising indicator is not set 
 * @retval      1             The specified channel capture falling rising indicator is set
 *
 * @details     This function is used to get capture rising latched indicator for specified channel
 *
 *
 */
#define _PWM_GET_CAP_RISING_INDICATOR(PWM,u32Ch) (((u32Ch)<2)?(((PWM)->CCR0 >> PWM_CCR0_CRLRI0_Pos >> ((u32Ch)*16)) & 1):(((PWM)->CCR2 >> PWM_CCR2_CRLRI2_Pos >> (((u32Ch)%2)*16)) & 1))




/**
 * @brief      Clear capture rising latched indicator for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to clear capture rising latched indicator for specified channel
 *
 *
 */
#define _PWM_CLR_CAP_RISING_INDICATOR(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_CRLRI0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_CRLRI2_Msk<<(((u32Ch)%2)*16)));\
}
        



/**
 * @brief      Get capture falling latched indicator for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3    
 * @retval      0        The specified channel capture falling latched indicator is not set 
 * @retval      1        The specified channel capture falling latched indicator is set
 *
 * @details     This function is used to get capture falling latched indicator for specified channel
 *
 */
#define _PWM_GET_CAP_FALLING_INDICATOR(PWM,u32Ch) (((u32Ch)<2)?(((PWM)->CCR0 >> PWM_CCR0_CFLRI0_Pos >> ((u32Ch)*16)) & 1):(((PWM)->CCR2 >> PWM_CCR2_CFLRI2_Pos >> (((u32Ch)%2)*16)) & 1))




/**
 * @brief       Clear capture falling latched indicator for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to clear capture falling latched indicator for specified channel
 *
 *
 */
#define _PWM_CLR_CAP_FALLING_INDICATOR(PWM,u32Ch)\
{\
    ((u32Ch)<2)?\
    ((PWM)->CCR0 = (PWM)->CCR0&PWM_CCR_MASK|(PWM_CCR0_CFLRI0_Msk<<((u32Ch)*16))):\
    ((PWM)->CCR2 = (PWM)->CCR2&PWM_CCR_MASK|(PWM_CCR2_CFLRI2_Msk<<(((u32Ch)%2)*16)));\
}




/**
 * @brief       Get capture rising latch register value for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      Capture rising latch register value 
 *
 * @details     This function is used to get capture rising latch register value for specified channel
 *
 *
 */
#define _PWM_GET_CAP_RISING_LATCH_VALUE(PWM,u32Ch) (*((__IO uint32_t *) (((uint32_t)&((PWM)->CRLR0) + (u32Ch)*8))))




/**
 * @brief      Get capture falling latch register value for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     Capture falling latch register value 
 *
 * @details    This function is used to get capture falling latch register value for specified channel
 *
 *
 */
#define _PWM_GET_CAP_FALLING_LATCH_VALUE(PWM,u32Ch) (*((__IO uint32_t *) (((uint32_t)&((PWM)->CFLR0) + (u32Ch)*8))))




/**
 * @brief      Enable capture input path for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to enable capture input path for specified channel
 *
 *
 */
#define _PWM_ENABLE_CAP_IN(PWM,u32Ch) ((PWM)->CAPENR |= (PWM_CAPENR_CINEN0_Msk<<(u32Ch)))



/**
 * @brief       Disable capture input path for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable capture input path for specified channel
 *
 *
 */
#define _PWM_DISABLE_CAP_IN(PWM,u32Ch) ((PWM)->CAPENR&= ~(PWM_CAPENR_CINEN0_Msk<<(u32Ch)))




/**
 * @brief       Enable PWM output path for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable PWM output path for specified channel
 *
 *
 */
#define _PWM_ENABLE_PWM_OUT(PWM,u32Ch) ((PWM)->POE |= (PWM_POE_PWM0_Msk<<(u32Ch)))




/**
 * @brief      Disable PWM output path for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to disable PWM output path for specified channel.
 *
 *
 */
#define _PWM_DISABLE_PWM_OUT(PWM,u32Ch) ((PWM)->POE &= ~(PWM_POE_PWM0_Msk<<(u32Ch)))




/**
 * @brief       Enable timer period trigger ADC function in center-aligned type for specified channel
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable PWM period trigger ADC to start of conversion. \n
 *              PWM trigger ADC to start of conversion in edge-aligned mode when counter equals to zero. \n
 *              PWM trigger ADC to start of conversion in center-aligned mode when counter equals to (CNR+1) or zero which depends on INTxxTYPE setting.
 *
 *
 */
#define _PWM_ENABLE_TIMER_PERIOD_TRIG_ADC(PWM,u32Ch) ((PWM)->TCON |= (PWM_TCON_PWM0TEN_Msk<<(u32Ch)))



