sufzoli/suf-electronics-motor-driver/SW/Misc/M051 PWM (latest)/cmsis_lib/inc/PWM.h
/**
 * @brief       Disable PWM period trigger ADC to start of conversion
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable PWM period trigger ADC to start of conversion. \n
 *
 *
 */
#define _PWM_DISABLE_TIMER_PERIOD_TRIG_ADC(PWM,u32Ch) ((PWM)->TCON &= ~(PWM_TCON_PWM0TEN_Msk<<(u32Ch)))




/**
 * @brief       Enable PWM duty trigger ADC to start of conversion
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable PWM duty trigger ADC to start of conversion. \n
 *              PWM trigger ADC to start of conversion in edge-aligned mode when counter equals to CMR. \n
 *              PWM trigger ADC to start of conversion in center-aligned mode when counter equals to CMR on up-count or down-count which depends on INTxxDTYPE setting.
 *
 *
 */
#define _PWM_ENABLE_TIMER_DUTY_TRIG_ADC(PWM,u32Ch) ((PWM)->TCON |= (PWM_TCON_PWM0DTEN_Msk<<(u32Ch)))




/**
 * @brief       Disable PWM duty trigger ADC to start of conversion
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable PWM duty trigger ADC to start of conversion. \n
 *
 *
 */
#define _PWM_DISABLE_TIMER_DUTY_TRIG_ADC(PWM,u32Ch) ((PWM)->TCON &= ~(PWM_TCON_PWM0DTEN_Msk<<(u32Ch)))




/**
 * @brief       Get PWM trigger ADC to start of conversion flag for specified channel
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @retval      0             The specified channel trigger ADC to start of conversion flag is not set 
 * @retval      1             The specified channel trigger ADC to start of conversion flag is set
 *
 * @details    This function is used to get PWM trigger ADC to start of conversion flag for specified channel
 *
 */
#define _PWM_GET_TIMER_TRIG_ADC_FLAG(PWM,u32Ch) (((PWM)->TSTATUS&(PWM_TSTATUS_PWM0TF_Msk<<(u32Ch)))?1:0)



/**
 * @brief      Clear timer trigger ADC to start conversion flag interrupt flag
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3      
 * @return     None
 *
 * @details    This function is used to clear timer trigger ADC to start conversion flag interrupt flag
 *
 */
#define _PWM_CLEAR_TIMER_TRIG_ADC_FLAG(PWM,u32Ch) ((PWM)->TSTATUS = (PWM_TSTATUS_PWM0TF_Msk<<(u32Ch)))




/**
 * @brief       Enable timer synchronous start
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to enable timer synchronous start.
 *
 *
 */
#define _PWM_ENABLE_TIMER_SYNC_START(PWM,u32Ch) ((PWM)->PSCR |= (PWM_PSCR_PSSEN0_Msk<<((u32Ch) * 8)))




/**
 * @brief       Disable timer synchronous start
 *
 * @param[in]   PWM            PWM group 
 *                             - PWMA : PWM Group A
 *                             - PWMB : PWM Group B 
 * @param[in]   u32Ch          PWM channel for PWM group A/B
 *                             - PWM_CH0
 *                             - PWM_CH1
 *                             - PWM_CH2
 *                             - PWM_CH3      
 * @return      None
 *
 * @details     This function is used to disable timer synchronous start.
 *
 *
 */
#define _PWM_DISABLE_TIMER_SYNC_START(PWM,u32Ch) ((PWM)->PSCR &= ~(PWM_PSCR_PSSEN0_Msk<<((u32Ch) * 8)))





/**
 * @brief      Reset PWM controller for specified group
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B     
 * @return     None
 *                                                           
 * @details    The function is used to reset PWM controller for specified group
 *
 * @note       PWM channel 0~3 in each group share the same PWM reset controller.
 */ 
extern __inline void PWM_ResetPwmController(PWM_T* PWM)
{
    SYS->IPRSTC2 |= (SYS_IPRSTC2_PWM03_RST_Msk<<(((PWM)==PWMA)?0:1));
    SYS->IPRSTC2 &= ~((SYS_IPRSTC2_PWM03_RST_Msk<<(((PWM)==PWMA)?0:1)));
}  




/**
 * @brief      Get PWM Clock Source Frequency
 *
 * @param[in]  PWM            PWM group 
 *                            - PWMA : PWM Group A
 *                            - PWMB : PWM Group B 
 * @param[in]  u32Ch          PWM channel for PWM group A/B
 *                            - PWM_CH0
 *                            - PWM_CH1
 *                            - PWM_CH2
 *                            - PWM_CH3  
 * @return     PWM clock source frequency
 * @details    Get the PWM clock source frequency for specified channel.
 *
 * @note       - PWM channel 0 and channel 1 share the same clock source setting. 
 *             - PWM channel 2 and channel 3 share the same clock source setting. 
 */
extern __inline uint32_t PWM_GetTimerClockSource(PWM_T* PWM, uint32_t u32Ch)
{
    uint8_t     u8EngineClk;
    uint32_t u32ClkTbl[4] = {__XTAL, __IRC10K, 0, __IRC22M};
    
    u32ClkTbl[2] = SystemCoreClock;        
    u8EngineClk = ((PWM)==PWMA)?((SYSCLK->CLKSEL1&(SYSCLK_CLKSEL1_PWM01_S_Msk<<(((u32Ch)/2)*2)))
                               >>(SYSCLK_CLKSEL1_PWM01_S_Pos+((u32Ch)/2)*2)):
                              ((SYSCLK->CLKSEL2&(SYSCLK_CLKSEL2_PWM45_S_Msk<<(((u32Ch)/2)*2)))
                               >>(SYSCLK_CLKSEL2_PWM45_S_Pos+((u32Ch)/2)*2));                                             
    return u32ClkTbl[u8EngineClk];    
}


/**
  * @} End of PWM Device Function Interface
  */ 

/**
  * @} End of M051 Function Interface
  */ 


#endif	//__PWM_H__



